// вы можете как угодно изменять программу и код
// добавлять любые переменные и модели
// ваша задача реализовать так, как показано на видео, чтобы оно работало

const App = {
  data() {
    return {
      activeIndex: 0, // то, что позволяет определить текущий активный шаг
      steps: [
        {id: 1, title: 'Основы', text: 'В блоке вы познакомитесь со всеми основами Vue.js на практике. На протяжении блока мы напишем реактивное приложение, в процессе разработки которого разберем вся базу фреймворка.'},
        {id: 2, title: 'Компоненты', text: 'Один из самых важных блоков в курсе, где вы узнаете все о компонентах. В блоке мы напишем 2 разных приложения и создадим более 5 различных UI компонентов как в реальной разработке. Блок расскажет про абсолютно все составляющие, которые есть в компонентах: взаимодействие, slots, асинхронные и динамические компоненты и тонна примеров.'},
        {id: 3, title: 'Роутер', text: 'В данном блоке вы узнаете все о том, как работает мультиязычность во Vue. Мы создадим миниклон Gmail в данном блоке, где вы на практике увидите как работать с динамическим роутером.'},
        {id: 4, title: 'Vuex', text: 'В блоке вы узнаете абсолютно все про Vuex. Вы узнаете как работать с данными, какие есть лучшие практики по их программированию и структурированию. Все на практике.'},
        {id: 5, title: 'Composition', text: 'Одним из наиболее важных обновлений в Vue 3 является появление альтернативного синтаксиса Composition API. В этом блоке вы узнаете все, чтобы полностью пользоваться данными синтаксисом на практических примерах. Помимо этого вы узнаете как работать совместно с Vue Router и Vuex.'},
      ],
      restart: false,
    }
  },
  methods: {
    // кнопка назад
    prev() {
      if (this.activeIndex > 0) {
        this.activeIndex--;
      }
    },
    // начать заново
    reset() {
      this.activeIndex = 0;
      this.restart = false;
    },
    // кнопка вперед
    nextOfFinish() {
      if (this.activeIndex < this.steps.length - 1) {
        this.activeIndex++;
      } else if (this.activeIndex === this.steps.length - 1) {
        this.restart = true;
      }
    },
    // переход по клику
    setActive(idx) {
      if (!this.restart) {
        this.activeIndex = idx;
      }
    }
  },
  computed: {
    // кнопка назад
    disBtnPrev() {
      if (this.activeIndex === 0) {
        return true;
      }
      return false;
    },
    // текст кнопки вперед
    textNextBtn() {
      if (this.activeIndex === 4) {
        return 'Закончить'
      }
      return 'Вперед';
    },
  }
}

Vue.createApp(App).mount('#app')